Tekla Open API Reference for Tekla Structures 2025
GridAttributes Properties
The Grid.GridAttributes type exposes the following members.
Properties
Name | Description
DrawOnlyTextLabelsNotGrids
 Set as true if you don't want to draw the grids, only show the grids' text labels.
DrawTextAtBottomOfGrid
 Set as true if you want to show the grid's text labels at the bottom of the grid.
DrawTextAtLeftOfGrid
 Set as true if you want to show the grid's text labels at the left of the grid.
DrawTextAtRightOfGrid
 Set as true if you want to show the grid's text labels at the right of the grid.
DrawTextAtTopOfGrid
 Set as true if you want to show the grid's text labels at the top of the grid.
Font
 The grid's font attributes.
Frame
 The frame attributes of the grid's labels.
Line
 The grid's line attributes.
OffsetAtEndOfLine
 The offset for the end of the grid lines.
OffsetAtStartOfLine
 The offset for the beginning of the grid lines.
Top
See Also
Reference
Grid.GridAttributes Class
Tekla.Structures.Drawing Namespace